Podkova/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннееПотреблениеТоваров</name>
  <basedOn>Document.ЗаказНаВнутреннееПотребление</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииНДСКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередаче</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураНоменклатура</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ТМЦВЭксплуатации</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПроизводственныхЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаВнутреннееПотребление</name>
    <type>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРаспоряжения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаполненияМногооборотнойТары</name>
    <type>
      <types>EnumRef.СостоянияЗаполненияМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыЗапасовУказаныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьМаркируемаяПродукцияГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЕстьАлкогольнаяПродукцияДляСписанияЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <comment>Код строки заказа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаВнутреннееПотребление</name>
      <type>
        <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <type>
        <types>CatalogRef.КатегорииЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияТМЦВЭксплуатации</name>
      <type>
        <types>CatalogRef.ПартииТМЦВЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектЭксплуатации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасовПолучателя</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Podkova/src/Documents/ВнутреннееПотреблениеТоваров/Forms/ФормаВыбораРаспоряжения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ЗначениеОтбора;
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	МассивОтборов = Новый Массив;
	МассивОтборов.Добавить("Организация");
	МассивОтборов.Добавить("Подразделение");
	МассивОтборов.Добавить("Склад");
	МассивОтборов.Добавить("Сделка");
	МассивОтборов.Добавить("ХозяйственнаяОперация");
	МассивОтборов.Добавить("НаправлениеДеятельности");
	
	Для каждого ИмяОтбора Из МассивОтборов Цикл
		Если Параметры.Отбор.Свойство(ИмяОтбора, ЗначениеОтбора) Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
				Список,
				ИмяОтбора,
				ЗначениеОтбора);
			
			Параметры.Отбор.Удалить(ИмяОтбора);
			
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"Регистратор",
		Параметры.Регистратор);

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ОбщегоНазначенияУТКлиент.ПроверитьНаличиеВыделенныхВСпискеСтрок(Элементы.Список) Тогда
		Закрыть(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
